src/cf/Enums/ВидыФормулБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыФормулБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеПроцент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеПроцент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Округлить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Итог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазностьДат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыЭлементовФинансовогоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЭлементовФинансовогоОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаголовокОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НередактируемыйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируемыйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонетарныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НемонетарныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеСтатьиБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказательБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеПоказателиБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиВСтроках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиВКолонках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаСложная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Колонки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯчейкаТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИтогПоГруппе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормулаПоГруппе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РежимыОтображенияДереваНовыхЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыОтображенияДереваНовыхЭлементов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкаВидаБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводныйПоказательВидаБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводныйПоказательСложнойТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВидаЯчейкиСложнойТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаАвторасчетаСложнойТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаВидаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаВидаОтчетаТолькоПоказатели</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РежимыФормированияБюджетныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыФормированияБюджетныхОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыВыводаСуммВБюджетныхОтчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыВыводаСуммВБюджетныхОтчетах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВВалютеСценария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВалютеУпрУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВалютеРеглУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СтатьиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтатьиБюджетов</Name>
			<Comment>Статьи бюджетов (показатели бюджетов)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресАналитикиКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВалюты</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОпределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресАналитикиВалюта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики4</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики5</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияОпределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики6</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИспользуемыхАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ПоказателиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиБюджетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресАналитикиКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВалюты</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОпределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресАналитикиВалюта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики4</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики5</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияОпределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитики6</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИспользуемыхАналитик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сценарии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКурсыДругогоСценария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийКурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребоватьУказанияКурсовДляКаждогоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/БюджетнаяОтчетностьВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура дополняет дерево операторов для конструктора формул
// финансовой и бюджетной отчетности
//
// Параметры:
//  Дерево  - ДеревоЗначений - дерево операторов конструктора формул
//
Процедура ДополнитьДеревоОператоров(Дерево) Экспорт
	
	Группа = Дерево.Строки.Найти("Функции");
	Для Каждого ЗначениеПеречисления из Метаданные.Перечисления.ВидыФормулБюджетирования.ЗначенияПеречисления Цикл
		
		РаботаСФормулами.ДобавитьОператор(Дерево, Группа, ЗначениеПеречисления.Синоним, 
			Перечисления.ВидыФормулБюджетирования.ТекстФункции(ЗначениеПеречисления.Имя));
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает значение цвета стиля
// вызывается из БюджетнаяОтчетностьКлиентСервер
//
// Параметры:
//  Имя  - Строка - Имя цвета стиля
//
// Возвращаемое значение:
//   Цвет - Цвет стиля, полученный по имени
//
Функция ПолучитьЦвет(Имя) Экспорт
	
	Возврат ЦветаСтиля[Имя];
	
КонецФункции

// Процедура заполняет палитру новых элементов, доступных
// для выбора в экземпляре бюджета, форме конструктора формул
//
// Параметры:
//  Форма  - УправляемаяФорма - форма, для элементов которых
//                              производится заполнение
//  Параметры  - Структура - дополнительные параметры дерева
//
Процедура ОбновитьДеревоНовыхЭлементов(Форма, Параметры) Экспорт
	
	БыстрыйПоиск = Неопределено;
	ИмяЭлементаДерева = ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры,"ИмяЭлементаДерева");
	БыстрыйПоиск = ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры,"БыстрыйПоиск");
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = ФинансоваяОтчетностьСервер.ТаблицаИндексовКартинок();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаНовыеЭлементыОтчета();
	
	ДоступныеВидыЭлементов = ПолучитьИспользуемыеВидыЭлементовФинансовыхОтчетов(
									Параметры.РежимДерева,
									ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры,"ИспользоватьДляВводаПлана", Ложь));
	Запрос.УстановитьПараметр("ДоступныеВидыЭлементов", ДоступныеВидыЭлементов);
	Запрос.УстановитьПараметр("РежимДерева", Параметры.РежимДерева);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ДеревоЭлементов = Форма.РеквизитФормыВЗначение(ИмяЭлементаДерева);
	ДеревоЭлементов.Строки.Очистить();
	
	// Создадим базовую структуру
	ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(МассивРезультатов[0], ДеревоЭлементов);
	
	// Добавим статьи
	СтрокаПоказателей = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов);
	Если СтрокаПоказателей <> Неопределено Тогда
		СтрокаПоказателей.Наименование = НСтр("en='Budget items';ru='Статьи бюджетов'");
		СтрокаПоказателей.ЭлементВидаОтчетности = Справочники.СтатьиБюджетов.ПустаяСсылка();
		ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(МассивРезультатов[1], СтрокаПоказателей);
		Если ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры, "ИспользоватьДляВводаПлана", Ложь) Тогда
			СтрокаПоказателей.ВидЭлемента = Неопределено;
		Иначе
			СтрокаПоказателей.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеСтатьиБюджетов;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаПоказателей = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов);
	Если СтрокаПоказателей <> Неопределено Тогда
		СтрокаПоказателей.Наименование = НСтр("en='Indicators of budgets';ru='Показатели бюджетов'");
		СтрокаПоказателей.ЭлементВидаОтчетности = Справочники.ПоказателиБюджетов.ПустаяСсылка();
		ФинансоваяОтчетностьСервер.РезультатЗапросаВДерево(МассивРезультатов[2], СтрокаПоказателей);
		Если ФинансоваяОтчетностьСервер.ПолучитьПараметр(Параметры, "ИспользоватьДляВводаПлана", Ложь) Тогда
			СтрокаПоказателей.ВидЭлемента = Неопределено;
		Иначе
			// Добавим показатели
			СтрокаПоказателей.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеПоказателиБюджетов;
		КонецЕсли;
	КонецЕсли;
	
	// Добавим группировки
	Если Параметры.РежимДерева = Перечисления.РежимыОтображенияДереваНовыхЭлементов.НастройкаВидаБюджета Тогда
		СтрокаГруппировки = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение);
		Если Параметры.Свойство("АналитикиШапки") Тогда
			АналитикиШапки = Параметры.АналитикиШапки;
		Иначе
			АналитикиШапки = Новый Массив;
		КонецЕсли;
		ДобавитьИзмеренияВДеревоНовыхЭлементов(ДеревоЭлементов, СтрокаГруппировки, 
						Параметры.МодельБюджетирования, Параметры.ИспользоватьДляВводаПлана, АналитикиШапки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БыстрыйПоиск) Тогда
		КопияДерева = ДеревоЭлементов.Скопировать();
		КопияДерева.Строки.Очистить();
		// Отсортируем элементы отчета внутри видов
		// порядок видов элементов сохраним
		Для Каждого СтрокаДерева из ДеревоЭлементов.Строки Цикл
			СтрокаДерева.Строки.Сортировать("Наименование", Истина);
		КонецЦикла;
		ОтобратьЭлементыПоБыстромуПоиску(ДеревоЭлементов, КопияДерева, БыстрыйПоиск);
		ДеревоЭлементов = КопияДерева;
	КонецЕсли;
	
	Форма.ЗначениеВРеквизитФормы(ДеревоЭлементов, ИмяЭлементаДерева);
	
КонецПроцедуры

Функция ТекстЗапросаНовыеЭлементыОтчета()
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|// 1. БАЗОВАЯ СТРУКТУРА
	|"
	+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЭлементовОтчетов.Ссылка КАК ВидЭлемента,
	|	ПРЕДСТАВЛЕНИЕ(ВидыЭлементовОтчетов.Ссылка) КАК Наименование,
	|	ТаблицаИндексовКартинок.ИндексКартинки КАК НестандартнаяКартинка
	|ИЗ
	|	Перечисление.ВидыЭлементовФинансовогоОтчета КАК ВидыЭлементовОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИндексовКартинок КАК ТаблицаИндексовКартинок
	|		ПО ВидыЭлементовОтчетов.Ссылка = ТаблицаИндексовКартинок.ВидЭлемента
	|			И (ТаблицаИндексовКартинок.ИмяВспомогательногоЭлемента = """")
	|ГДЕ
	|	ВидыЭлементовОтчетов.Ссылка В(&ДоступныеВидыЭлементов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЭлементовОтчетов.Порядок"
	+"
	|;";
	
	ТекстЗапроса = ТекстЗапроса + "
	|////////////////////////////////////////////////////////////////////////////////
	|// 2.1.1 БАЗОВЫЕ ПОКАЗАТЕЛИ ПО СТАТЬЯМ БЮДЖЕТОВ
	|"
	+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЭлементыОтчетов.ЭтоГруппа
	|				И ЗНАЧЕНИЕ(Перечисление.РежимыОтображенияДереваНовыхЭлементов.НастройкаВидаБюджета) <> &РежимДерева
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов)
	|	КОНЕЦ КАК ВидЭлемента,
	|	ЭлементыОтчетов.Наименование КАК Наименование,
	|	"""" КАК Комментарий,
	|	ЭлементыОтчетов.Ссылка КАК ЭлементВидаОтчетности,
	|	ТаблицаИндексовКартинок.ИндексКартинки КАК НестандартнаяКартинка,
	|	ЭлементыОтчетов.ЭтоГруппа
	|ИЗ
	|	Справочник.СтатьиБюджетов КАК ЭлементыОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИндексовКартинок КАК ТаблицаИндексовКартинок
	|		ПО (ВЫБОР
	|				КОГДА ЭлементыОтчетов.ЭтоГруппа
	|					ТОГДА ТаблицаИндексовКартинок.ИмяВспомогательногоЭлемента = ""Группа""
	|				ИНАЧЕ ТаблицаИндексовКартинок.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов)
	|						И ТаблицаИндексовКартинок.ИмяВспомогательногоЭлемента = """"
	|			КОНЕЦ)
	|ГДЕ
	|	ЭлементыОтчетов.ПометкаУдаления = ЛОЖЬ
	|АВТОУПОРЯДОЧИВАНИЕ"
	+"
	|;";
	
	ТекстЗапроса = ТекстЗапроса + "
	|////////////////////////////////////////////////////////////////////////////////
	|// 2.1.2 БАЗОВЫЕ ПОКАЗАТЕЛИ ПО ПОКАЗАТЕЛЯМ БЮДЖЕТИРОВАНИЯ
	|"
	+
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЭлементыОтчетов.ЭтоГруппа
	|				И ЗНАЧЕНИЕ(Перечисление.РежимыОтображенияДереваНовыхЭлементов.НастройкаВидаБюджета) <> &РежимДерева
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов)
	|	КОНЕЦ КАК ВидЭлемента,
	|	ЭлементыОтчетов.Наименование КАК Наименование,
	|	"""" КАК Комментарий,
	|	ЭлементыОтчетов.Ссылка КАК ЭлементВидаОтчетности,
	|	ТаблицаИндексовКартинок.ИндексКартинки КАК НестандартнаяКартинка,
	|	ЭлементыОтчетов.ЭтоГруппа
	|ИЗ
	|	Справочник.ПоказателиБюджетов КАК ЭлементыОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИндексовКартинок КАК ТаблицаИндексовКартинок
	|		ПО (ВЫБОР
	|				КОГДА ЭлементыОтчетов.ЭтоГруппа
	|					ТОГДА ТаблицаИндексовКартинок.ИмяВспомогательногоЭлемента = ""Группа""
	|				ИНАЧЕ ТаблицаИндексовКартинок.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов)
	|						И ТаблицаИндексовКартинок.ИмяВспомогательногоЭлемента = """"
	|			КОНЕЦ)
	|ГДЕ
	|	ЭлементыОтчетов.ПометкаУдаления = ЛОЖЬ
	|АВТОУПОРЯДОЧИВАНИЕ"
	+"
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьИспользуемыеВидыЭлементовФинансовыхОтчетов(РежимРаботы, ИспользоватьДляВводаПлана)
	
	Список = Новый СписокЗначений;
	
	Если РежимРаботы <> Перечисления.РежимыОтображенияДереваНовыхЭлементов.НастройкаАвторасчетаСложнойТаблицы Тогда
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов);
		Если РежимРаботы <> Перечисления.РежимыОтображенияДереваНовыхЭлементов.ПроизводныйПоказательВидаБюджета
			И РежимРаботы <> Перечисления.РежимыОтображенияДереваНовыхЭлементов.ПроизводныйПоказательСложнойТаблицы Тогда
			Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ПроизводныйПоказатель);
		КонецЕсли;
	КонецЕсли;
	
	Если РежимРаботы = Перечисления.РежимыОтображенияДереваНовыхЭлементов.ПроизводныйПоказательСложнойТаблицы
		ИЛИ РежимРаботы = Перечисления.РежимыОтображенияДереваНовыхЭлементов.НастройкаАвторасчетаСложнойТаблицы Тогда
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы);
	КонецЕсли;
	
	Если РежимРаботы = Перечисления.РежимыОтображенияДереваНовыхЭлементов.НастройкаВидаБюджета Тогда
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ЗаголовокОтчета);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.НередактируемыйТекст);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ТаблицаСложная);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.Группа);
		Список.Добавить(Перечисления.ВидыЭлементовФинансовогоОтчета.ФормулаПоГруппе);
	КонецЕсли;
	
	Возврат Список;
	
КонецФункции

Процедура ОтобратьЭлементыПоБыстромуПоиску(ДеревоЭлементов, КопияДерева, БыстрыйПоиск)
	
	Для Каждого СтрокаДерева из ДеревоЭлементов.Строки Цикл
		Если Найти(НРег(СтрокаДерева.Наименование), НРег(БыстрыйПоиск))
			И ЗначениеЗаполнено(СтрокаДерева.ВидЭлемента)
			И СтрокаДерева.ЭтоГруппа = Ложь Тогда
			
			ЗаполнитьЗначенияСвойств(КопияДерева.Строки.Добавить(), СтрокаДерева);
			
		КонецЕсли;
		ОтобратьЭлементыПоБыстромуПоиску(СтрокаДерева, КопияДерева, БыстрыйПоиск);
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьСтрокуИзмерения(СтрокаКудаДобавлять, Наименование, ЭлементОтчета = Неопределено)
	
	НоваяСтрока = СтрокаКудаДобавлять.Строки.Добавить();
	Измерение = Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение;
	НоваяСтрока.ВидЭлемента = Измерение;
	НоваяСтрока.НестандартнаяКартинка = ФинансоваяОтчетностьПовтИсп.НестандартнаяКартинка(Измерение);
	НоваяСтрока.Наименование = Наименование;
	НоваяСтрока.ЭлементВидаОтчетности = ?(ЭлементОтчета = Неопределено, Наименование, ЭлементОтчета);
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДобавитьИзмеренияВДеревоНовыхЭлементов(ДеревоЭлементов, СтрокаГруппировки, МодельБюджетирования, ИспользоватьДляВводаПлана, АналитикиШапки)
	
	// Добавим элементы таблицы
	СтрокаИзмерения = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.ТаблицаСложная);
	СтрокаЭлемент = СтрокаИзмерения.Строки.Добавить();
	ЭлементТаблицы = Перечисления.ВидыЭлементовФинансовогоОтчета.ЭлементТаблицы;
	СтрокаЭлемент.НестандартнаяКартинка = ФинансоваяОтчетностьПовтИсп.НестандартнаяКартинка(ЭлементТаблицы);
	СтрокаЭлемент.Наименование = Строка(Перечисления.ВидыЭлементовФинансовогоОтчета.ЭлементТаблицы);
	СтрокаЭлемент.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ЭлементТаблицы;

	СтрокаИзмерения = ДеревоЭлементов.Строки.Найти(Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение);
	СтрокаИзмерения.ВидЭлемента = Неопределено; //группировочная запись о измерениях 
												// не может быть перенесена в элементы бюджета
	
	// добавление периода
	
	СтрокаПериод = ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Период");
	СтрокаПериод.ВидЭлемента = Неопределено; //группировочная запись о измерениях 
	СтрокаПериод.ЭтоГруппа = Истина;		 //не может быть перенесена в элементы бюджета
	СтрокаПериод.НестандартнаяКартинка = ФинансоваяОтчетностьВызовСервера.НестандартнаяКартинка(Неопределено, "Группа");
	
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Год", 		Перечисления.Периодичность.Год);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Полугодие",	Перечисления.Периодичность.Полугодие);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Квартал",	Перечисления.Периодичность.Квартал);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Месяц",		Перечисления.Периодичность.Месяц);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Декада",		Перечисления.Периодичность.Декада);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "Неделя",		Перечисления.Периодичность.Неделя);
	ДобавитьСтрокуИзмерения(СтрокаПериод, "День",		Перечисления.Периодичность.День);
	
	// добавление аналитики
	
	СтрокаАналитика = ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Аналитика");
	СтрокаАналитика.ВидЭлемента = Неопределено;	//группировочная запись о измерениях 
	СтрокаАналитика.ЭтоГруппа = Истина; 		//не может быть перенесена в элементы бюджета
	СтрокаАналитика.НестандартнаяКартинка = ФинансоваяОтчетностьВызовСервера.НестандартнаяКартинка(Неопределено, "Группа");
	
	Если Не ИспользоватьДляВводаПлана Тогда
		
		Для Сч = 1 По 6 Цикл
			ДобавитьСтрокуИзмерения(СтрокаАналитика, "Аналитика " + Сч, "Аналитика" + Сч);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Аналитика.Ссылка,
	|	Аналитика.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.АналитикиСтатейБюджетов КАК Аналитика
	|ГДЕ
	|	НЕ Аналитика.ПометкаУдаления
	|	И НЕ Аналитика.Ссылка В (&АналитикиШапки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Запрос.УстановитьПараметр("ИспользоватьДляВводаПлана", ИспользоватьДляВводаПлана);
	Запрос.УстановитьПараметр("АналитикиШапки", АналитикиШапки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = ПланыВидовХарактеристик.АналитикиСтатейБюджетов.Проекты Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьСтрокуИзмерения(СтрокаАналитика, Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	
	// добавление организации
	
	Если ПолучитьФункциональнуюОпцию("ФормироватьБюджетыПоОрганизациям", 
			Новый Структура("МодельБюджетирования", МодельБюджетирования))
			И НЕ ИспользоватьДляВводаПлана Тогда
		ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Организация");
	КонецЕсли;
	
	// добавление подразделения
	
	Если ПолучитьФункциональнуюОпцию("ФормироватьБюджетыПоПодразделениям", 
			Новый Структура("МодельБюджетирования", МодельБюджетирования))
			И НЕ ИспользоватьДляВводаПлана Тогда
		ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Подразделение");
	КонецЕсли;
	
	// добавление сценария
	
	Если Не ИспользоватьДляВводаПлана Тогда
		СтрокаСценарии = ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Сценарий", "Сценарий");
	КонецЕсли;
	
	// добавление валюты
	
	ДобавитьСтрокуИзмерения(СтрокаИзмерения, "Валюта");
	
КонецПроцедуры

Функция ЗначениеГруппировкиЗаданоОтбором(ЭлементОтбора)
	
	Если ЭлементОтбора = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭлементОтбора.Родитель <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ (ЭлементОтбора.Использование И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно)
		И НЕ (ЭлементОтбора.Использование И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено) Тогда
		
		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Если НЕ (ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений")
				И ЭлементОтбора.ПравоеЗначение.Количество() = 1) Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПреобразоватьПериодПоПравилуИсточника(Параметры, ПравилоИсточника)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ПравилоИсточника);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ГраницаФактДанных", Параметры.ГраницаФактДанных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка[0];
	
КонецФункции

Функция ПериодГруппировкиСоСмещением(Период, ПериодичностьСмещения, ПериодСмещения)
	
	Если Не ЗначениеЗаполнено(ПериодичностьСмещения)
		ИЛИ Не ЗначениеЗаполнено(ПериодСмещения) Тогда
		
		Возврат Период;
		
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ДобавитьКДате(&Период, " + ПериодичностьСмещения + ", -" + ПериодСмещения + ")";
	Запрос.УстановитьПараметр("Период", Период);
	
	Возврат Запрос.Выполнить().Выгрузить()[0][0];
	
КонецФункции

Функция СписокПериодовПоПравилуПреобразования(МинимальнаяПериодичность, ТекущийПериодГруппировки, 
												Параметры, ИсточникПериодовГруппировки, ИсточникДанных)
	
	Если ИсточникПериодовГруппировки = Неопределено Тогда
		Период = ПериодГруппировкиСоСмещением(ТекущийПериодГруппировки, 
							ИсточникДанных.ПериодичностьСмещения, ИсточникДанных.ПериодСмещения);
		Список = Новый СписокЗначений;
		Список.Добавить(Период);
		Возврат Список;
	КонецЕсли;
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	МассивПериодов = БюджетнаяОтчетностьСервер.ПолучитьМассивПериодов(Параметры.НачалоПериода, Параметры.КонецПериода, МинимальнаяПериодичность);
	
	Для Каждого Период из МассивПериодов Цикл
		НоваяСтрока = ТаблицаПериодов.Добавить();
		НоваяСтрока["Период"] = Период;
	КонецЦикла;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|
	|	Период КАК Период" + МинимальнаяПериодичность + "
	|
	|ПОМЕСТИТЬ ТаблицаПериодов
	|
	|ИЗ &ТаблицаПериодов КАК ТаблицаПериодов;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|
	|	&Период КАК Период" + МинимальнаяПериодичность + "
	|
	|ПОМЕСТИТЬ ПериодТекущейГруппировки;
	|
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|
	| ПраваяТаблицаПериодов.Период" + МинимальнаяПериодичность + " КАК Период
	|
	|ИЗ ПериодТекущейГруппировки КАК ЛеваяТаблицаПериодов
	|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ПраваяТаблицаПериодов
	|ПО ПраваяТаблицаПериодов.Период" + МинимальнаяПериодичность + 
		" МЕЖДУ " + ИсточникПериодовГруппировки.ВыражениеНачалоПериодаГруппировки + " И " + ИсточникПериодовГруппировки.ВыражениеКонецПериодаГруппировки;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ГраницаФактДанных", Параметры.ГраницаФактДанных);
	Запрос.УстановитьПараметр("Период", ТекущийПериодГруппировки);
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Список = Новый СписокЗначений;
	Для Каждого Элемент из Массив Цикл
		Период = ПериодГруппировкиСоСмещением(Элемент, ИсточникДанных.ПериодичностьСмещения, ИсточникДанных.ПериодСмещения);
		Список = Новый СписокЗначений;
		Список.Добавить(Период);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьПараметрыОтчета(ПараметрыОтчета, ДанныеЯчеек, СвязаннаяСтрокаДанных, ВидРасшифровки, ИмяПоказателя)
	
	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных();
	СтруктураКолонок = БюджетнаяОтчетностьСервер.ПолучитьСтруктуруКолонокТаблицыДанныхВидаБюджета(ПараметрыОтчета.ВидБюджета);
	ИсточникиДанных = БюджетнаяОтчетностьСервер.ПолучитьОписаниеИсточниковДанных(ПараметрыОтчета.ВидБюджета, СтруктураКолонок,
																		Перечисления.РежимыФормированияБюджетныхОтчетов.Отчет);
	СтруктураОписанияОтчета = БюджетнаяОтчетностьСервер.ПолучитьСтруктуруОписанияВидаБюджета(ПараметрыОтчета.ВидБюджета,
																		СтруктураКолонок,
																		Перечисления.РежимыФормированияБюджетныхОтчетов.Отчет);
	СтруктураЯчеек = СтруктураОписанияОтчета.СтруктураЯчеек;
	ПараметрыЯчеек = СтруктураОписанияОтчета.ПараметрыЯчеек;
	
	СтрокаСтруктурыЯчеек = СтруктураЯчеек.Найти(СвязаннаяСтрокаДанных.ИндексСтроки, "ИндексСтроки");
	СтрокаПараметровЯчейки = ПараметрыЯчеек.Найти(СвязаннаяСтрокаДанных.ИндексСтроки, "ИндексСтроки");
	
	Для Каждого Измерение из СтруктураКолонок.Измерения Цикл
		
		Если Измерение = "ЕдиницаИзмерения" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "заполнить"
			или СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "отобрать" Тогда
			
			Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Измерение);
			Если ЗначениеЗаполнено(СвязаннаяСтрокаДанных[Измерение]) Тогда
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Отбор.ПравоеЗначение = СвязаннаяСтрокаДанных[Измерение];
			Иначе
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			КонецЕсли;
			Отбор.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ВидАналитики из СтруктураКолонок.ВидыАналитик Цикл
		Измерение = БюджетнаяОтчетностьСервер.ИмяПоляБюджетногоОтчета(ВидАналитики);
		
		Если СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "заполнить"
			или СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "отобрать" Тогда
			
			Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Измерение);
			Если ЗначениеЗаполнено(СвязаннаяСтрокаДанных[Измерение]) Тогда
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				Отбор.ПравоеЗначение = СвязаннаяСтрокаДанных[Измерение];
			Иначе
				Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			КонецЕсли;
			Отбор.Использование = Истина;
			
		ИначеЕсли СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "прочие"
			или СтрокаСтруктурыЯчеек["Флаг" + Измерение] = "документ" Тогда
			
			Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Измерение);
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
			
			СтруктураПоиска = Новый Структура();
			СтруктураПоиска.Вставить("Родитель" + Измерение, СтрокаСтруктурыЯчеек["Родитель" + Измерение]);
			СтруктураПоиска.Вставить("Флаг" + Измерение, "отобрать");
			
			КопияТаблицыДляСписка = СтруктураЯчеек.Скопировать(СтруктураПоиска);
			КопияТаблицыДляСписка.Свернуть(Измерение);
			Массив = КопияТаблицыДляСписка.ВыгрузитьКолонку(Измерение);
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(Массив);
			
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
			Отбор.ПравоеЗначение = СписокЗначений;
			Отбор.Использование = Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючИЗначение из ПараметрыОтчета.ДополнительныеФильтрыПоАналитикам Цикл
		
		Измерение = КлючИЗначение.Ключ;
		Значение = Неопределено;
		Используется = ПараметрыОтчета.Свойство(КлючИЗначение.Ключ, Значение);
		Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Измерение);
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Отбор.ПравоеЗначение = Значение;
		Отбор.Использование = Используется;
		
	КонецЦикла;
	
	Для Каждого Источник из ИсточникиДанных Цикл
		Если Источник.Идентификатор = СтрокаСтруктурыЯчеек.ИД_Источника Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	НастройкиАналитики = Неопределено;
	Если ЗначениеЗаполнено(СвязаннаяСтрокаДанных.ПоказательБюджетов) Тогда
		Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоказательБюджетов");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = СвязаннаяСтрокаДанных.ПоказательБюджетов;
		Отбор.Использование = Истина;
		НастройкиАналитики = СвязаннаяСтрокаДанных.ПоказательБюджетов;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СвязаннаяСтрокаДанных.СтатьяБюджетов) Тогда
		Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатьяБюджетов");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = СвязаннаяСтрокаДанных.СтатьяБюджетов;
		Отбор.Использование = Истина;
		Если НастройкиАналитики = Неопределено Тогда
			НастройкиАналитики = СвязаннаяСтрокаДанных.СтатьяБюджетов;
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериода = ПреобразоватьПериодПоПравилуИсточника(ПараметрыОтчета, Источник.ВыражениеНачалоПериода);
	КонецПериода = ПреобразоватьПериодПоПравилуИсточника(ПараметрыОтчета, Источник.ВыражениеКонецПериода);
	
	МинимальнаяПериодичность = Перечисления.Периодичность.МинимальнаяПериодичность(СтруктураКолонок.Периодичности);
	Если МинимальнаяПериодичность <> Неопределено Тогда
		ЗначениеПериода = СвязаннаяСтрокаДанных["Период" + МинимальнаяПериодичность];
		Если ЗначениеЗаполнено(ЗначениеПериода) Тогда
			
			ИскомыйИсточник = Неопределено;
			Для Каждого ИсточникПериодовГруппировки из СтруктураОписанияОтчета.ИсточникиПериодовГруппировок Цикл
				Если ИсточникПериодовГруппировки.Идентификатор = СтрокаСтруктурыЯчеек.ИД_ИсточникаПериодов Тогда
					ИскомыйИсточник = ИсточникПериодовГруппировки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ПолеПериод = Новый ПолеКомпоновкиДанных("Период" + МинимальнаяПериодичность);
			
			Отбор = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = ПолеПериод;
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.ПравоеЗначение = СписокПериодовПоПравилуПреобразования(МинимальнаяПериодичность, ЗначениеПериода, 
																		ПараметрыОтчета, ИскомыйИсточник, Источник);
			Отбор.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
	
	Параметр = ФиксированныеНастройки.ПараметрыДанных.Элементы.Добавить();
	Параметр.Параметр = Новый ПараметрКомпоновкиДанных("Период");
	Параметр.Значение = Период;
	Параметр.Использование = Истина;
	
	Параметр = ФиксированныеНастройки.ПараметрыДанных.Элементы.Добавить();
	Параметр.Параметр = Новый ПараметрКомпоновкиДанных("ДатаАктуальностиДанных");
	Параметр.Значение = КонецДня(ПараметрыОтчета.ДатаАктуальности);
	Параметр.Использование = Истина;
	
	Параметр = ФиксированныеНастройки.ПараметрыДанных.Элементы.Добавить();
	Параметр.Параметр = Новый ПараметрКомпоновкиДанных("Валюта");
	
	ЕстьВалюта = СтруктураКолонок.Измерения.Найти("Валюта") <> Неопределено И
	(ЗначениеЗаполнено(СвязаннаяСтрокаДанных.Валюта) ИЛИ ЗначениеЗаполнено(СтрокаПараметровЯчейки.ВалютаВывода));
	
	Если ЕстьВалюта Тогда
		Параметр.Значение = ?(ЗначениеЗаполнено(СвязаннаяСтрокаДанных.Валюта), 
		СвязаннаяСтрокаДанных.Валюта, СтрокаПараметровЯчейки.ВалютаВывода);
	ИначеЕсли ПараметрыОтчета.ВариантСумм = Перечисления.ВариантыВыводаСуммВБюджетныхОтчетах.ВВалютеРеглУчета Тогда
		Параметр.Значение = Константы.ВалютаРегламентированногоУчета.Получить();
	ИначеЕсли ПараметрыОтчета.ВариантСумм = Перечисления.ВариантыВыводаСуммВБюджетныхОтчетах.ВВалютеУпрУчета Тогда
		Если уатОбщегоНазначенияТиповые.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда
			Параметр.Значение = Константы.ВалютаУправленческогоУчета.Получить();
		Иначе
			Параметр.Значение = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
	Иначе
		Параметр.Значение = ПараметрыОтчета.ВалютаСценария;
	КонецЕсли;
	Параметр.Использование = Истина;
	
	Параметр = ФиксированныеНастройки.ПараметрыДанных.Элементы.Добавить();
	Параметр.Параметр = Новый ПараметрКомпоновкиДанных("ОборотыВСтатусах");
	Параметр.Значение = ПараметрыОтчета.Статус;
	Параметр.Использование = Истина;
	
	ФинансоваяОтчетностьСервер.СкопироватьОтбор(Источник.ДополнительныйОтбор.Отбор, ФиксированныеНастройки.Отбор);
	БюджетнаяОтчетностьСервер.ДополнитьНастройкиСКДПередВыводом(ФиксированныеНастройки, ПараметрыОтчета);
	
	ПризнакиИзмерений = Новый Структура;
	Параметры = Новый Структура("МодельБюджетирования", ПараметрыОтчета.ВидБюджета.Владелец);
	ПризнакиИзмерений.Вставить("ПоОрганизациям", ПолучитьФункциональнуюОпцию("ФормироватьБюджетыПоОрганизациям", Параметры));
	ПризнакиИзмерений.Вставить("ПоПодразделениям", ПолучитьФункциональнуюОпцию("ФормироватьБюджетыПоПодразделениям", Параметры));
	ПризнакиИзмерений.Вставить("ПоСценариям", Истина);
	
	Если ЗначениеЗаполнено(НастройкиАналитики) Тогда
		
		СтруктураРеквизитов = Новый Структура(
				"Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5, Аналитика6",
				"ВидАналитики1", "ВидАналитики2", "ВидАналитики3", "ВидАналитики4", "ВидАналитики5", "ВидАналитики6");
		
		НастройкиАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкиАналитики, СтруктураРеквизитов);
		
		Если НастройкиАналитики.Свойство("ПоОрганизациям") Тогда
			ЗаполнитьЗначенияСвойств(ПризнакиИзмерений, НастройкиАналитики, "ПоОрганизациям, ПоПодразделениям");
			ПризнакиИзмерений.Вставить("ПоСценариям", Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	МассивИзмеренийКДобавлению = Новый Массив;
	
	МассивИзмеренийКДобавлению.Добавить(ВидРасшифровки);
	Если ПризнакиИзмерений.ПоСценариям Тогда
		МассивИзмеренийКДобавлению.Добавить("Сценарий");
	КонецЕсли;
	Если ПризнакиИзмерений.ПоОрганизациям Тогда
		МассивИзмеренийКДобавлению.Добавить("Организация");
	КонецЕсли;
	Если ПризнакиИзмерений.ПоПодразделениям Тогда
		МассивИзмеренийКДобавлению.Добавить("Подразделение");
	КонецЕсли;
	Для Сч = 1 по 6 Цикл
		МассивИзмеренийКДобавлению.Добавить("Аналитика" + Сч);
	КонецЦикла;
	
	Если МинимальнаяПериодичность <> Неопределено Тогда
		МассивИзмеренийКДобавлению.Добавить("Период" + МинимальнаяПериодичность);
	КонецЕсли;
	
	МассивИзмеренийОтчета = Новый Массив;
	
	Для Каждого Элемент из МассивИзмеренийКДобавлению Цикл
		
		ЭлементОтбора = ФинансоваяОтчетностьСервер.НайтиЭлементОтбора(ФиксированныеНастройки.Отбор, Элемент);
		
		Если ЗначениеГруппировкиЗаданоОтбором(ЭлементОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастройкиАналитики) Тогда
			
			Если Найти(Элемент, "Аналитика") Тогда
				ВидАналитики = НастройкиАналитики[Элемент];
				Если ЗначениеЗаполнено(ВидАналитики) Тогда
					ИмяПоля = БюджетнаяОтчетностьСервер.ИмяПоляБюджетногоОтчета(ВидАналитики);
					ЭлементОтбора = ФинансоваяОтчетностьСервер.НайтиЭлементОтбора(ФиксированныеНастройки.Отбор, ИмяПоля);
					Если ЗначениеГруппировкиЗаданоОтбором(ЭлементОтбора) Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		МассивИзмеренийОтчета.Добавить(Элемент);
		
	КонецЦикла;
	
	Если Не МассивИзмеренийОтчета.Количество() Тогда
		МассивИзмеренийОтчета.Добавить("Регистратор");
	КонецЕсли;
	
	НоваяГруппировка = Неопределено;
	Для Каждого ЭлементМассива из МассивИзмеренийОтчета Цикл
		Если НоваяГруппировка = Неопределено Тогда
			НоваяГруппировка = ФинансоваяОтчетностьСервер.НоваяГруппировка(ФиксированныеНастройки.Структура, ЭлементМассива);
		Иначе
			НоваяГруппировка = ФинансоваяОтчетностьСервер.НоваяГруппировка(НоваяГруппировка, ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Если ВидРасшифровки = "ПоказательБюджетов" Тогда
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "НачальныйОстатокСценария");
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Заголовок = НСтр("en='Opening balance';ru='Начальный остаток'");
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "ПриходСценария");
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Заголовок = НСтр("en='Income';ru='Приход'");
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "РасходСценария");
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Заголовок = НСтр("en='Expense';ru='Расход'");
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "ОборотСценария");
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Заголовок = НСтр("en='Turnover (Income - Expense)';ru='Оборот (Приход - Расход)'");
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "КонечныйОстатокСценария");
		ПолеВыбор.Использование = Истина;
		ПолеВыбор.Заголовок = НСтр("en='Closing balance';ru='Конечный остаток'");
		
	ИначеЕсли ВидРасшифровки = "СтатьяБюджетов" Тогда
		
		ПолеВыбор = ФиксированныеНастройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных(ИмяПоказателя + "Сценария");
		ПолеВыбор.Использование = Истина;
		
		ТекстНСТР = НСтр("en='%1 script';ru='%1 сценария'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, ИмяПоказателя);
		ПолеВыбор.Заголовок = ТекстНСТР;
		
	КонецЕсли;
	
	Возврат ФиксированныеНастройки;
	
КонецФункции

Функция ПараметрыОткрытияОтчетаРасшифровки(ПараметрыФормирования, Расшифровка, АдресДанныхЯчеек) Экспорт
	Перем ЗначениеОтбора;
	
	ДанныеЯчеек = ПолучитьИзВременногоХранилища(АдресДанныхЯчеек);
	СвязаннаяСтрокаДанных = ДанныеЯчеек[Расшифровка.ИндексСтрокиДанных];
	ИмяПоказателя = Расшифровка.ИмяПоказателя;
	
	СтруктураКолонок = БюджетнаяОтчетностьСервер.ПолучитьСтруктуруКолонокТаблицыДанныхВидаБюджета(ПараметрыФормирования.ВидБюджета);
	СтруктураОписанияОтчета = БюджетнаяОтчетностьСервер.ПолучитьСтруктуруОписанияВидаБюджета(
								ПараметрыФормирования.ВидБюджета, СтруктураКолонок, ПараметрыФормирования.РежимФормирования);
	
	ПараметрыЯчеек = СтруктураОписанияОтчета.ПараметрыЯчеек;
	
	Если СвязаннаяСтрокаДанных.ОсновнойЭлемент Тогда
		ВидЭлементаКРасшифровке = СвязаннаяСтрокаДанных.ВидЭлемента;
	Иначе
		ВидЭлементаКРасшифровке = СвязаннаяСтрокаДанных.ВидОперанда;
	КонецЕсли;
	
	ПараметрыРасшифровки = Новый Структура;
	Если ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов
		ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеСтатьиБюджетов
		ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов
		ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеПоказателиБюджетов Тогда
		
		Если ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов
			ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеСтатьиБюджетов Тогда
			ПараметрыРасшифровки.Вставить("ИмяФормы", "Отчет.ОборотнаяВедомостьБюджетирования.Форма");
			ВидРасшифровки = "СтатьяБюджетов";
		ИначеЕсли ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов
			ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеПоказателиБюджетов Тогда
			ПараметрыРасшифровки.Вставить("ИмяФормы", "Отчет.ОборотноСальдоваяВедомостьБюджетирования.Форма");
			ВидРасшифровки = "ПоказательБюджетов";
		КонецЕсли;
		
		ФиксированныеНастройки = ПолучитьПараметрыОтчета(ПараметрыФормирования, ДанныеЯчеек, СвязаннаяСтрокаДанных, ВидРасшифровки, ИмяПоказателя);
		ПараметрыОтчета = Новый Структура();
		ПараметрыОтчета.Вставить("ФиксированныеНастройки", ФиксированныеНастройки);
		ПараметрыОтчета.Вставить("КлючВарианта", "Расшифровка");
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
		
		ПараметрыРасшифровки.Вставить("ПараметрыОтчета", ПараметрыОтчета);
		
	ИначеЕсли ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ПроизводныйПоказатель
		ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.ФормулаПоГруппе
		ИЛИ ВидЭлементаКРасшифровке = Перечисления.ВидыЭлементовФинансовогоОтчета.Группа Тогда
		
		Если СвязаннаяСтрокаДанных.ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.Группа Тогда
			ЛогРасчета = Новый Массив;
			ПараметрыПериодов = БюджетнаяОтчетностьСервер.ПреобразоватьПараметрыДанныхВДанныеПериодов(СтруктураКолонок, ПараметрыФормирования);
			БюджетнаяОтчетностьСервер.РассчитатьЗначениеЯчейки(ДанныеЯчеек, ПараметрыЯчеек, ПараметрыПериодов, СвязаннаяСтрокаДанных, ИмяПоказателя, , ЛогРасчета);
			ИндексСвязаннаяСтрокаДанных = ЛогРасчета[0].СтрокаОснование;
		Иначе
			ИндексСвязаннаяСтрокаДанных = ДанныеЯчеек.Индекс(СвязаннаяСтрокаДанных);
		КонецЕсли;
		
		ХранимыеПараметрыОтчета = Новый Структура;
		Для Каждого КлючИЗначение из ПараметрыФормирования Цикл
			// Пропускаем вспомогательные параметры для заполнения
			// экземпляра бюджета
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("ТаблицаЗначений")
				ИЛИ ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			ХранимыеПараметрыОтчета.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		ХранимыеПараметрыОтчета.Вставить("ДополнительныеФильтрыПоАналитикам", 	ПараметрыФормирования.ДополнительныеФильтрыПоАналитикам);
		ХранимыеПараметрыОтчета.Вставить("АдресДанныхЯчеек", 	АдресДанныхЯчеек);
		ХранимыеПараметрыОтчета.Вставить("ИндексСтрокиДанных", 	ИндексСвязаннаяСтрокаДанных);
		ХранимыеПараметрыОтчета.Вставить("ИмяПоказателя", 		ИмяПоказателя);
		
		ПараметрыОтчета = Новый Структура();
		ПараметрыОтчета.Вставить("КлючВарианта", "РасшифровкаФормулыБюджетногоОтчета");
		ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыОтчета.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
		ПараметрыОтчета.Вставить("ХранимыеПараметрыОтчета", ХранимыеПараметрыОтчета);
		
		ПараметрыРасшифровки.Вставить("ИмяФормы", "Отчет.РасшифровкаФормулыБюджетногоОтчета.Форма");
		ПараметрыРасшифровки.Вставить("ПараметрыОтчета", ПараметрыОтчета);
		
	Иначе
		ТекстНСТР = НСтр("en='Unknown element to decrypt';ru='Неизвестный элемент для расшифровки'");
		ВызватьИсключение ТекстНСТР;
		
	КонецЕсли;
	
	Возврат ПараметрыРасшифровки;
		
КонецФункции

Функция ПараметрыФормыРасшифровкиОтчетаРасшифровки(Расшифровка, АдресРасшифровки) Экспорт
	
	Поля = ПолучитьИзВременногоХранилища(АдресРасшифровки).Элементы[Расшифровка].ПолучитьПоля();
	АдресПараметровРасшифровки = Поля.Найти("АдресПараметровОтчета").Значение;
	Если АдресПараметровРасшифровки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПараметрыОтчета = ПолучитьИзВременногоХранилища(АдресПараметровРасшифровки);
	ИндексСтрокиДанных = Поля.Найти("ИндексСтрокиДанных").Значение;
	ИмяПоказателя = Поля.Найти("ИмяПоказателя").Значение;
	
	ПараметрыДанных = Новый Структура("ИндексСтрокиДанных, ИмяПоказателя", ИндексСтрокиДанных, ИмяПоказателя);
	
	Возврат ПараметрыОткрытияОтчетаРасшифровки(ПараметрыОтчета, ПараметрыДанных, ПараметрыОтчета.АдресДанныхЯчеек);
	
КонецФункции

Функция ПараметрыНастройкиДополнительныхПолей(Знач Объект, Знач ВидАналитики) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТипЗначения", ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВидАналитики, "ТипЗначения"));
	ПараметрыФормы.Вставить("ДополнительныеПоля", ПоместитьВоВременноеХранилище(Объект.ДополнительныеПоля.Выгрузить()));
	Возврат ПараметрыФормы;
	
КонецФункции


Функция ТипыВидовАналитик(МассивОбъектов) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, "ТипЗначения");
	
КонецФункции

Функция СвойстваАналитикОтчета(АдресПараметрыВыводаВидаБюджета) Экспорт
	
	ПараметрыВывода = ПолучитьИзВременногоХранилища(АдресПараметрыВыводаВидаБюджета);
	
	СвойстваАналитик = Новый Структура;
	
	// Упорядоченный массив всех аналитик отчета для определения порядка аналитик по расшифровке и типы аналитик.
	СвойстваАналитик.Вставить("ВидыАналитикОтчета", ПараметрыВывода.СтруктураКолонокТаблицыДанных.ВидыАналитик);
	СвойстваАналитик.Вставить("ЗначенияТипов", ТипыВидовАналитик(СвойстваАналитик.ВидыАналитикОтчета));
	
	Возврат СвойстваАналитик;
	
КонецФункции


#Область ЭкземплярБюджета

Функция БлижайшийПланируемыйКурсКДате(СтрокиКурса, ПериодПланирования)
	
	Курс = СтрокиКурса[0].Курс;
	Для Каждого СтрокаКурса Из СтрокиКурса Цикл
		Если СтрокаКурса.Период > ПериодПланирования Тогда
			Возврат Курс;
		КонецЕсли;
		Курс = СтрокаКурса.Курс;
	КонецЦикла;
	
	Возврат Курс;
	
КонецФункции

Функция ТаблицаКурсов(ОбъектИПараметрыРасчета, СтруктураПараметров, Отказ, ТекстСообщения) Экспорт
	
	ТребоватьУказанияКурсовДляКаждогоПериода = ОбъектИПараметрыРасчета.ТребоватьУказанияКурсовДляКаждогоПериода;
	Объект = ОбъектИПараметрыРасчета.Объект;
	
	СтруктураЯчеек = СтруктураПараметров.СтруктураОписанияОтчета.СтруктураЯчеек;
	
	КопияСтруктурыЯчеекВалюта = СтруктураЯчеек.Скопировать(,"Валюта");
	КопияСтруктурыЯчеекВалюта.Свернуть("Валюта");
	МассивВалют = КопияСтруктурыЯчеекВалюта.ВыгрузитьКолонку("Валюта");
	
	МассивВалютДокумента = ОбъектИПараметрыРасчета.Объект.АналитикаСтатейБюджетов.Выгрузить(,"Валюта").ВыгрузитьКолонку("Валюта");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВалют, МассивВалютДокумента, Истина);
	
	МассивДополнительныхВалют = Новый Массив;
	МассивДополнительныхВалют.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Сценарий, "Валюта"));
	МассивДополнительныхВалют.Добавить(Константы.ВалютаУправленческогоУчета.Получить());
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВалют, МассивДополнительныхВалют, Истина);
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВГраница = МассивВалют.ВГраница();
	Удалено = 0;
	
	Для Сч = 0 По ВГраница Цикл
		
		ТекущийИндекс = Сч - Удалено;
		Если Не ЗначениеЗаполнено(МассивВалют[ТекущийИндекс])
			ИЛИ МассивВалют[ТекущийИндекс] = ВалютаРеглУчета Тогда
			
			Удалено = Удалено + 1;
			МассивВалют.Удалить(ТекущийИндекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаКурсов = Справочники.Сценарии.ТаблицаКурсовСценария(Объект.Сценарий, МассивВалют, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
	Если Не ТребоватьУказанияКурсовДляКаждогоПериода Тогда
		
		НоваяСтрока = ТаблицаКурсов.Добавить();
		НоваяСтрока.Период = Объект.НачалоПериода;
		НоваяСтрока.Валюта = ВалютаРеглУчета;
		НоваяСтрока.Курс = 1;
		
		ТаблицаКурсов.Сортировать("Валюта, Период");
		ТаблицаКурсов.Индексы.Добавить("Валюта");
		ТаблицаКурсов.Индексы.Добавить("Валюта, Период");
		
		НеНайденныеВалюты = Новый Массив;
		Для Каждого Валюта Из МассивВалют Цикл
			
			СтруктураПоиска = Новый Структура("Валюта, Период", Валюта, Объект.НачалоПериода);
			НайденныеСтроки = ТаблицаКурсов.НайтиСтроки(СтруктураПоиска);
			
			Если Не НайденныеСтроки.Количество() Тогда
				НеНайденныеВалюты.Добавить(Валюта);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НеНайденныеВалюты.Количество() Тогда
			
			ТекстСообщения = НСтр("ru = 'Не найдены прогнозные курсы на начало периода для валют: %1';
									|en = 'Forecasted exchange rates for currencies as of the period start are not found: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
								СтрСоединить(НеНайденныеВалюты, ", "));
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Периодичности = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Периодичности, СтруктураПараметров.СтруктураКолонокТаблицыДанных.Периодичности);
		Периодичности.Добавить(Объект.ВидБюджета.Периодичность);
		ПериодичностьПроверкиКурсов = БюджетнаяОтчетностьКлиентСервер.МинимальнаяПериодичность(Периодичности);
		МассивПериодов = БюджетнаяОтчетностьВыводСервер_ПериодыБюджетногоОтчета(Объект.НачалоПериода, Объект.ОкончаниеПериода, ПериодичностьПроверкиКурсов);
		НеНайденныеКурсы = ТаблицаКурсов.СкопироватьКолонки("Период, Валюта");
		
		Для Каждого Период Из МассивПериодов Цикл
			Для Каждого Валюта Из МассивВалют Цикл
				СтруктураПоиска = Новый Структура("Валюта, Период", Валюта, Период);
				Если Не ТаблицаКурсов.НайтиСтроки(СтруктураПоиска).Количество() Тогда
					НоваяСтрока = НеНайденныеКурсы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если НеНайденныеКурсы.Количество() Тогда
			
			НеНайденныеКурсы.Свернуть("Валюта");
			МассивВалют = НеНайденныеКурсы.ВыгрузитьКолонку("Валюта");
			ТекстСообщения = НСтр("ru = 'Не найдены прогнозные курсы для валют: %1; курсы должны быть указаны на %2';
									|en = 'Forecasted exchange rates are not found for currencies: %1; exchange rates should be specified for %2'");
			
			Если ПериодичностьПроверкиКурсов = Перечисления.Периодичность.Декада Тогда
				СклонениеКаждый = НСтр("ru = 'каждую декаду';
										|en = 'every ten-day period'");
			ИначеЕсли ПериодичностьПроверкиКурсов = Перечисления.Периодичность.Неделя Тогда
				СклонениеКаждый = НСтр("ru = 'каждую неделю';
										|en = 'every week'");
			Иначе
				СклонениеКаждый = НСтр("ru = 'каждый %1';
										|en = 'each %1'");
				СклонениеКаждый = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СклонениеКаждый, НРег(ПериодичностьПроверкиКурсов));
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
				СтрСоединить(МассивВалют, ", "),
				СклонениеКаждый);
			Отказ = Истина;
			
		Иначе
			
			Для Каждого Период Из МассивПериодов Цикл
				НоваяСтрока = ТаблицаКурсов.Добавить();
				НоваяСтрока.Период = Период;
				НоваяСтрока.Валюта = ВалютаРеглУчета;
				НоваяСтрока.Курс = 1;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаКурсов;
	
КонецФункции

// Функция возвращает массив периодов
//
// Параметры:
//  НачалоПериода  - Дата - начало периода
//  КонецПериода  - Дата - окончание периода
//  Периодичность  - ПеречислениеСсылка.Периодичность - периодичность шага.
//
// Возвращаемое значение:
//   Массив - массив периодов
//
Функция БюджетнаяОтчетностьВыводСервер_ПериодыБюджетногоОтчета(Знач НачалоПериода, Знач КонецПериода, Периодичность)
	
	Результат = Новый Массив;
	НачалоПериода = БюджетированиеКлиентСервер.ДатаНачалаПериода(НачалоПериода, Периодичность);
	Пока НачалоПериода <= КонецПериода Цикл
		Результат.Добавить(НачалоПериода);
		НачалоПериода = БюджетированиеКлиентСервер.ДобавитьИнтервал(НачалоПериода, Периодичность, 1);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьТаблицуКурсов(ОбъектИПараметрыРасчета, ПредыдущаяТаблицаКурсов)
	Перем Отказ, ТекстСообщения;
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(ОбъектИПараметрыРасчета.ПараметрыВыводаВидаБюджета);
	Если СтруктураПараметров = Неопределено Тогда
		Возврат ПредыдущаяТаблицаКурсов;
	КонецЕсли;
	
	ТаблицаКурсов = ТаблицаКурсов(ОбъектИПараметрыРасчета, СтруктураПараметров, Отказ, ТекстСообщения);
	
	Возврат ТаблицаКурсов;
	
КонецФункции

Функция ПересчитатьПоТаблицеКурсов(ОбъектИПараметрыРасчета, Сумма, ПериодПланирования, ВалютаНач, ВалютаКон) Экспорт
	
	АдресТаблицыКурсов = ОбъектИПараметрыРасчета.АдресТаблицыКурсов;
	ТребоватьУказанияКурсовДляКаждогоПериода = ОбъектИПараметрыРасчета.ТребоватьУказанияКурсовДляКаждогоПериода;
	
	ТаблицаКурсов = ПолучитьИзВременногоХранилища(АдресТаблицыКурсов);
	
	Если ТребоватьУказанияКурсовДляКаждогоПериода Тогда
		СтруктураПоиска = Новый Структура("Валюта, Период", ВалютаНач, ПериодПланирования);
	Иначе
		СтруктураПоиска = Новый Структура("Валюта", ВалютаНач);
	КонецЕсли;
	
	СтрокиКурса 	= ТаблицаКурсов.НайтиСтроки(СтруктураПоиска);
	Если Не СтрокиКурса.Количество() Тогда
		ТаблицаКурсов = ОбновитьТаблицуКурсов(ОбъектИПараметрыРасчета, ТаблицаКурсов);
		ПоместитьВоВременноеХранилище(ТаблицаКурсов, АдресТаблицыКурсов);
		СтрокиКурса 	= ТаблицаКурсов.НайтиСтроки(СтруктураПоиска);
		Если Не СтрокиКурса.Количество() Тогда
			Возврат Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребоватьУказанияКурсовДляКаждогоПериода Тогда
		КурсНач 		= СтрокиКурса[0].Курс;
		СтрокиКурса 	= ТаблицаКурсов.НайтиСтроки(Новый Структура("Валюта, Период", ВалютаКон, ПериодПланирования));
		Если Не СтрокиКурса.Количество() Тогда
			Возврат Сумма;
		КонецЕсли;
		КурсКон 		= СтрокиКурса[0].Курс;
	Иначе

		КурсНач 		= БлижайшийПланируемыйКурсКДате(СтрокиКурса, ПериодПланирования);
		СтрокиКурса 	= ТаблицаКурсов.НайтиСтроки(Новый Структура("Валюта", ВалютаКон));
		Если Не СтрокиКурса.Количество() Тогда
			Возврат Сумма;
		КонецЕсли;
		КурсКон 		= БлижайшийПланируемыйКурсКДате(СтрокиКурса, ПериодПланирования);
	КонецЕсли;
	
	Возврат Сумма * КурсНач / КурсКон;
	
КонецФункции


// Значение расшифровки
// 
// Параметры:
// 	НомерРасшифровки - Число, ИдентификаторРасшифровкиКомпоновкиДанных, Неопределено -
// 	АдресДанныхРасшифровки - Строка -
// Возвращаемое значение:
// 	 - Неопределено - 
// 	 - Соответствие - Описание:
// 		* Ключ - Число, ИдентификаторРасшифровкиКомпоновкиДанных -
// 		* Значение - ЭлементРасшифровкиКомпоновкиДанныхПоля, ЭлементРасшифровкиКомпоновкиДанныхГруппировка - 
// 	 - Структура - Структура со свойствами:
// 		* Строка - СправочникСсылка.ЭлементыФинансовыхОтчетов - Строка бюджета.
//
Функция ЗначениеРасшифровки(НомерРасшифровки, АдресДанныхРасшифровки) Экспорт
	
	Если НомерРасшифровки = Неопределено // Курсор установлен не в ячейке с данными. Например, в шапке
		Или ТипЗнч(НомерРасшифровки) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда // Курсор установлен в ячейке, в которой не настроен вид
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	
	Если ДанныеРасшифровки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(НомерРасшифровки) = Тип("Число") Тогда
		Возврат ДанныеРасшифровки[НомерРасшифровки];
	КонецЕсли;
	
	Результат = Новый Соответствие;
	Для Каждого ИндексРасшифровки Из НомерРасшифровки Цикл
		Результат.Вставить(ИндексРасшифровки, ДанныеРасшифровки[ИндексРасшифровки]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#КонецОбласти
